# Offset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid..::..Offset Property
FillGrid Class See Also
---
Gets and sets the offset of the fill grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Offset { get; set; }
```

Visual Basic
---
```text
Public Property Offset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Offset {
	double get ();
	void set (double value);
}
```

# ### Field Value
The offset of the fill grid.
# Remarks
Offset defines the distance between parallel lines. A zero offset is not allowed.
# See Also
FillGrid Class
Autodesk.Revit.DB Namespace